{
    "DEFAULT_TRANSLATOR": "Standardübersetzer",
    "GOOGLE_TRANSLATE": "Google Übersetzer",
    "MICROSOFT_TRANSLATE": "Microsoft Translator",
    "HIGHLIGHT_MODE": "Längste Übersetzung hervorheben",
    "TRANSLATE_MODE": "Übersetzte Zeichenfläche in Vorschau anzeigen",
    "REMOVE_MODE": "Übersetzungen löschen",
    "TRANSLATE_WITH_LABEL": "Übersetzen mit",
    "ADOBE_TRANSLATION_LIMIT": "Auf 10.000 Wörter pro Monat begrenzt. Übersetzt mit ",
    "API_KEY_LABEL": "API-Schlüssel",
    "LANGUAGES_LABEL": "Sprachen",
    "SOURCE_LANGUAGE_LABEL": "(Ausgangssprache wählen)",
    "GERMAN_LABEL": "Deutsch",
    "FRENCH_LABEL": "Französisch",
    "JAPANESE_LABEL": "Japanisch",
    "SPANISH_LABEL": "Spanisch",
    "ITALIAN_LABEL": "Italienisch",
    "CHINESE_SIMPLIFIED_LABEL": "Chinesisch vereinfacht",
    "KOREAN_LABEL": "Koreanisch",
    "RUSSIAN_LABEL": "Russisch",
    "TURKISH_LABEL": "Türkisch",
    "UKRAINIAN_LABEL": "Ukrainisch",
    "FINNISH_LABEL": "Finnisch",
    "BRAZILIAN_PORTUGUESE_LABEL": "Portugiesisch (Brasilien)",
    "DUTCH_LABEL": "Niederländisch",
    "SWEDISH_LABEL": "Schwedisch",
    "ENGLISH_LABEL": "Englisch",
    "OK_BUTTON": "OK",
    "MODE_LABEL": "Modus",
    "HIGHLIGHT_LABEL": "Hervorheben",
    "TRANSLATE_LABEL": "Übersetzen",
    "HIGHLIGHT_DETAIL": "Hebt Textfelder hervor, die für die Lokalisierung größer sein sollten. Zeigt für jede Zeichenfolge die längste Übersetzung an.",
    "TRANSLATE_DETAIL": "Übersetzt den gesamten Text in die ausgewählten Sprachen. Zeichenflächen werden für jede Sprache dupliziert.",
    "CANCEL_BUTTON": "Abbrechen",
    "UNDO_TRANSLATIONS": "Übersetzen rückgängig machen",
    "SOURCE_ARTBOARD_ERROR": "Wählen Sie die Quellzeichenfläche aus, um World Ready-Aktionen auszuführen.",
    "ERROR_LABEL": "Fehler",
    "SELECTION_MESSAGE": "Mit Auswahl beginnen",
    "ARTBOARD_SELECTOPN_MESSAGE": "Wählen Sie eine Zeichenfläche aus, um World Ready zu verwenden.",
    "WORLDREADY_LABEL": "World Ready",
    "ANALYTICS_HEADER": "Analytics",
    "ACCEPT_BUTTON": "Annehmen",
    "GENERIC_ERROR": "Allgemeiner Fehler: Überprüfen Sie Ihr Netzwerk oder versuchen Sie es später erneut.",
    "TIMEOUT_ERROR": "Zeitüberschreitung bei der Anforderung. Versuchen Sie es später erneut.",
    "PLUGIN_TIMEOUT": "Zeitüberschreitung beim World Ready-Plug-in. Versuchen Sie es später erneut.",
    "WARNING_LABEL": "Warnung",
    "UNTRANSLATED_STRINGS_WARNING": "Einige Zeichenfolgen bleiben möglicherweise aufgrund eines Dienstfehlers unübersetzt.",
    "SUCCESS_LABEL": "Erfolg",
    "WORLD_READY_SUCCESS_MESSAGE": "Sehr gut! Ihr Design ist World Ready. \nKeine Hervorhebungen für die ausgewählten Sprachen.",
    "NO_REPEAT_GRID_SUPPORT_WARNING": "Die Vorschau unterstützt keine Wiederholungsraster- und Symbolinstanzen.",
    "SOURCE_LANG_LABEL": "Ausgangssprache ",
    "ANALYTICS_MESSAGE": "Mit diesem Plug-in werden Nutzungsdaten erfasst und über HTTPS-Anforderungen an sichere Adobe-Server gesendet, um die Benutzerfreundlichkeit bei der Verwendung des Plug-ins zu verbessern.\n\nZur Nachverfolgung der Analysedaten muss der Text (Zeichenfolgen), den Sie zur Übersetzung einreichen, vom Plug-in auf unseren sicheren Servern gespeichert werden.\n\nDer gespeicherte Text (Zeichenfolgen) wird zu keinem anderen Zweck weiterverteilt als für Nutzungstrends und Analysen zur Verbesserung der Benutzerfreundlichkeit.\n\nIndem Sie auf „Annehmen“ klicken, stimmen Sie allen Erklärungen oben zu und können dann mit der Verwendung des Plug-ins fortfahren. Um die Erfassung von Nutzungsdaten zu deaktivieren, können Sie dieses Plug-in jederzeit löschen, indem Sie die folgenden Schritte ausführen:\nRufen Sie das Menü „Plug-ins“ auf. Wählen Sie „Plug-ins verwalten“.\nKlicken Sie in den Einstellungen von World Ready auf „Deinstallieren“.\n\n",
    "SUMMARY": "Lokalisierung für Ihre Designs.",
    "DESCRIPTION": "Das World Ready-Plug-in bietet folgende Funktionen: 1. Überprüfen des Layouts Ihrer Zeichenflächen auf Eignung für die Lokalisierung. 2. Erstellen lokalisierter Zeichenflächen. Wählen Sie nach dem Start des Plug-ins über das Menü „Plug-ins“ in XD einen Übersetzungsdienst und dann den Modus „Hervorheben“ oder „Übersetzen“ sowie die Sprachen, für die Sie den Test durchführen möchten.\n\n  – Hervorhebungsmodus: Um alle Textelemente, bei denen die Übersetzung in mindestens eine Sprache nicht auf die ausgewählte Zeichenfläche passt, wird ein roter Begrenzungsrahmen angezeigt. In den Elementen wird zudem die längste übersetzte Zeichenfolge dargestellt.\n\n  – Übersetzungsmodus: Es werden Zeichenflächen mit übersetztem Text erstellt, sodass Sie die Zeichenflächen in verschiedenen Sprachen vergleichen können.\n\n  Weitere Informationen finden Sie in der Datei „Bitte lesen“ zum Plug-in.",
    "KEYWORDS": [
        "Übersetzen",
        "Übersetzung",
        "lokalisieren",
        "Lokalisierung",
        "mehrsprachig",
        "Globalisierung",
        "Layout",
        "Produktivität",
        "Zusammenarbeit"
      ],
    "ABOUT_SUMMARY": "<h1 style='marginLeft: -10px'>Das World Ready-Plug-in für Adobe XD</h1>Bedenken Sie beim Erstellen Ihrer Dateien, dass diese später in mehrere Sprachen lokalisiert werden. Mit dem World Ready-Plug-in können Sie sicherstellen, dass der Text in Ihren Zeichenflächen auch in den Sprachen, in die Ihre Datei lokalisiert werden soll, in die Elemente passt. Mit World Ready können Sie außerdem schnell vergleichen, wie Elemente in der Ausgangssprache nach der Übersetzung in eine andere Sprache aussehen werden. <h2 style='marginLeft: -10px'>World Ready installieren</h2><br /> 1. Starten Sie Adobe XD.<br /> 2. Öffnen Sie das Menü „Plug-ins“. Wählen Sie „Plug-ins entdecken“. Suchen Sie nach „World Ready“.<br /> 3. Zum Installieren des Plug-ins klicken Sie einfach auf die Schaltfläche „Installieren“. Das Setup ist jetzt abgeschlossen. Überprüfen Sie jetzt Ihre Datei auf die Eignung für die Lokalisierung. <h2 style='marginLeft: -10px'> Prüfen, ob lokalisierte Zeichenfolge in allen Sprachen in Elemente passen</h2> Beim Erstellen eines Designs wird die Größe der Elemente in der Regel an die Länge des Texts in der Arbeitssprache angepasst. Oft werden andere Sprachen, in die eine Datei lokalisiert wird, jedoch nicht berücksichtigt. Überprüfen Sie mit World Ready im Handumdrehen, ob es lokalisierte Zeichenfolgen gibt, die nicht in die Elemente des Designs passen.<br /> 1. Wählen Sie bei geöffnetem Design in Adobe XD die Zeichenfläche aus, die Sie testen möchten. Hinweis: Wählen Sie eine einzelne Zeichenfläche in Ihrer Datei aus.<br /> 2. Wählen Sie im Menü „Plug-ins“ die Option „World Ready“.<br /> 3. Wählen Sie im Dialogfeld „World Ready“ einen Übersetzungsdienst. Hinweis: Der Standard-Übersetzungsdienst (Übersetzung von Microsoft) ist bei diesem Plug-in unmittelbar verfügbar. Um die anderen Dienste zu verwenden, müssen Sie einen entsprechenden Lizenzschlüssel eingeben. Um einen Lizenzschlüssel abzurufen, klicken Sie einfach auf (?) rechts neben dem Feld „API-Schlüssel“. Der Lizenzschlüssel wird an folgenden Orten auf Ihrem System gespeichert: WINDOWS: „C:\\Users\\<Benutzer>\\AppData\\Local\\Packages\\Adobe.CC.XD_adky2gkssdxte\\LocalState\\plugin_settings\\com.g11n.worldready“ MAC: „\\Users\\<Benutzer>\\Library\\Application Support\\Adobe\\Adobe XD CC\\plugin_settings\\com.g11n.worldready“.<br /> 4. Wählen Sie „Hervorheben“.<br /> 5. Wählen Sie dann eine oder mehrere Sprachen aus, in denen Sie Ihre Zeichenfläche testen möchten. Hinweis: World Ready unterstützt derzeit die aufgeführten Sprachen.<br /> 6. Klicken Sie auf „Hervorheben“.<br /> 7. Warten Sie einen Moment. Wenn der übersetzte Text bei einer oder mehreren Sprachen über die Textelemente in Ihrer Zeichenfläche hinausreicht, sehen Sie rote Begrenzungsrahmen um diese Elemente. Außerdem fügt World Ready den Text für die längsten übersetzten Zeichenfolgen im Hintergrund ein.<br /> 8. Sie können jetzt entweder die Größe der Elemente oder den Text ändern.<br /> 9. Wiederholen Sie den Test bei Bedarf.<br /> 10. Wenn Sie über weitere textbasierte Zeichenflächen verfügen, führen Sie den Test auch für diese durch. Ihre Datei ist jetzt World Ready. <h2 style='marginLeft: -10px'>Vorschau der lokalisierten Zeichenflächen</h2> Erstellen Sie Vorschau-Zeichenflächen in anderen Sprachen und vergleichen Sie sie mit den von Ihnen verfassten.<br /> 1. Wählen Sie bei geöffnetem Design in Adobe XD die Zeichenfläche aus, die Sie in einer anderen Sprache in der Vorschau ansehen möchten. Hinweis: Wählen Sie eine einzelne Zeichenfläche in Ihrer Datei aus.<br /> 2. Wählen Sie im Menü „Plug-ins“ die Option „World Ready“.<br /> 3. Wählen Sie im Dialogfeld „World Ready“ einen Übersetzungsdienst. Hinweis: Der Standard-Übersetzungsdienst (Übersetzung von Microsoft) ist bei diesem Plug-in unmittelbar verfügbar. Um die anderen Dienste zu verwenden, müssen Sie einen entsprechenden Lizenzschlüssel eingeben. Um einen Lizenzschlüssel abzurufen, klicken Sie einfach auf (?) rechts neben dem Feld „API-Schlüssel“. Der Lizenzschlüssel wird an folgenden Orten auf Ihrem System gespeichert: WINDOWS: „C:/Users/<Benutzer>/AppData/Local/Packages/Adobe.CC.XD_adky2gkssdxte/LocalState/plugin_settings/com.g11n.worldready“ MAC: „/Users/<user>/Library/Application Support/Adobe/Adobe XD CC/plugin_settings/com.g11n.worldready“.<br /> 4. Wählen Sie „Übersetzen“.<br /> 5. Wählen Sie dann die Sprachen aus, die Sie in der Vorschau anzeigen und vergleichen möchten. Hinweis: World Ready unterstützt derzeit die aufgeführten Sprachen.<br /> 6. Klicken Sie auf „Übersetzen“.<br /> 7. Warten Sie einen Moment. Doppelte Zeichenflächen werden innerhalb des Frame platziert. Außerdem wird der Text in dieser Zeichenfläche in die von Ihnen ausgewählte Sprache übersetzt. Sie können diese Zeichenflächen jetzt vergleichen.<br /> Nachdem Sie mit World Ready Ihre Zeichenflächen überprüft und in der Vorschau angezeigt haben, löschen Sie World Ready-Elemente aus Ihrer Datei. Stellen Sie sicher, dass die World Ready-Elemente aus Ihrer Datei entfernt wurden.<br /> 1. Wählen Sie im Menü „Plug-ins“ die Option „World Ready“.<br /> 2. Wählen Sie „Übersetzen rückgängig machen“. Alle World Ready-Elemente werden jetzt aus Ihrer Datei entfernt. <h2 style='marginLeft: -10px'> Danksagung </h2> Akulaa Agarwal Ankit Kapoor Achintya Dixit Rajat Budhiraja Chhaya Nathani Hinweis: Adobe verwendet Übersetzungen von Anbietern für Maschinenübersetzung und diese sind direkt verantwortlich für die Übersetzungen und nicht Adobe. Die Übersetzungs-APIs verarbeiten keine Sonderzeichen. Der Lizenzschlüssel des Benutzers wird auf seinem Clientcomputer im Benutzerordner gespeichert.",
    "About_MENU": "Über",
    "HELP_MENU": "Hilfe",
    "LAUNCH_MENU": "Plug-in starten",
    "SUPPORT": "Support",
    "CONTACT_US": "Kontakt"
}
