{
  "DEFAULT_TRANSLATOR": "Default Translator",
  "GOOGLE_TRANSLATE": "Google Translate",
  "MICROSOFT_TRANSLATE": "Microsoft Translate",
  "HIGHLIGHT_MODE": "Highlight the longest translation",
  "TRANSLATE_MODE": "Preview Translated Artboard",
  "REMOVE_MODE": "Clear translations",
  "TRANSLATE_WITH_LABEL": "Translate with",
  "ADOBE_TRANSLATION_LIMIT": "Limited to 10,000 words per month. Translated by ",
  "API_KEY_LABEL": "API Key",
  "LANGUAGES_LABEL": "Target Languages",
  "SOURCE_LANGUAGE_LABEL": "(Select source language)",
  "GERMAN_LABEL": "German",
  "FRENCH_LABEL": "French",
  "JAPANESE_LABEL": "Japanese",
  "SPANISH_LABEL": "Spanish",
  "ITALIAN_LABEL": "Italian",
  "CHINESE_SIMPLIFIED_LABEL": "Chinese Simplified",
  "KOREAN_LABEL": "Korean",
  "RUSSIAN_LABEL": "Russian",
  "TURKISH_LABEL": "Turkish",
  "UKRAINIAN_LABEL": "Ukrainian",
  "FINNISH_LABEL": "Finnish",
  "BRAZILIAN_PORTUGUESE_LABEL": "Brazilian Portuguese",
  "DUTCH_LABEL": "Dutch",
  "SWEDISH_LABEL": "Swedish",
  "ENGLISH_LABEL": "English",
  "OK_BUTTON": "Ok",
  "MODE_LABEL": "Mode",
  "HIGHLIGHT_LABEL": "Highlight",
  "TRANSLATE_LABEL": "Translate",
  "HIGHLIGHT_DETAIL": "Highlights text boxes that should be bigger for localization. Shows longest translation per string.",
  "TRANSLATE_DETAIL": "Translates all text to the selected languages. Artboards are duplicated per language.",
  "CANCEL_BUTTON": "Cancel",
  "UNDO_TRANSLATIONS": "Undo Translations",
  "SOURCE_ARTBOARD_ERROR": "Please select source artboard to run World Ready actions.",
  "ERROR_LABEL": "Error",
  "SELECTION_MESSAGE": "Start with a selection",
  "ARTBOARD_SELECTOPN_MESSAGE": "Select an artboard to use World Ready.",
  "WORLDREADY_LABEL": "World Ready",
  "ANALYTICS_HEADER": "Analytics",
  "ACCEPT_BUTTON": "Accept",
  "GENERIC_ERROR": "Generic Error: Please check network or try again later.",
  "TIMEOUT_ERROR": "Request timed out. Please try again later.",
  "PLUGIN_TIMEOUT": "World Ready Plugin timed out. Please try again later.",
  "WARNING_LABEL": "Warning",
  "UNTRANSLATED_STRINGS_WARNING": "Some strings may remain untranslated due to service error.",
  "SUCCESS_LABEL": "Success",
  "WORLD_READY_SUCCESS_MESSAGE": "Good Job! Your design is World Ready. \nNothing to highlight for the selected languages.",
  "NO_REPEAT_GRID_SUPPORT_WARNING": "Preview will not support Repeat Grid and Symbol Instance.",
  "SOURCE_LANG_LABEL": "Source Language ",
  "ANALYTICS_MESSAGE": "This plugin collects usage data and submits it to secure Adobe servers via HTTPS requests to enhance your experience when using the plugin.\n\nIn order to track analytics, this plugin needs to store the text (strings) you send for translation to our secure servers.\n\nThe text (strings) that are stored will not be distributed or used for any other purposes, except for usage trends and analytics to enhance user experience.\n\nBy clicking accept you agree to all of the above and can proceed to use the plugin. To opt out of usage data collection, you can delete this plugin at any time by following below steps:\nGo to Plugins Menu. Select Manage Plugins.\nFind World Ready and Click Uninstall in its settings.\n\n",
  "SUMMARY": "Localize your designs.",
  "DESCRIPTION": "World Ready plugin can be used to 1. Check layout of your artboards for localization readiness & 2. Generate localized artboards. After launching the plugin from the Plugins menu in XD, pick a translation service, choose the “Highlight” or “Translate” mode and select the languages to test.\n\n  - Highlight mode: Show red bounding boxes around all text elements for which at least one language doesn't fit in the selected artboard. The elements also show the longest translated string.\n\n  - Translate mode: Creates artboards with translated text which allows you to compare the artboards across languages.\n\n  For more information go through the ReadMe included within the plugin.",
  "KEYWORDS": [
      "translate",
      "translation",
      "localize",
      "localization",
      "multilingual",
      "globalization",
      "layout",
      "productivity",
      "collaboration"
    ],
  "ABOUT_SUMMARY": "<h1 style='marginLeft: -10px'>The World Ready plugin for Adobe XD</h1>As you design your files, keep in mind they will later be localized in multiple languages.Use the World Ready plugin to make sure that the text in your artboards fits inside the elements for the languages that you plan to localize your file to. Or use World Ready to quickly compare what elements in the original language will look like once they're translated to another language. <h2 style='marginLeft: -10px'>Install World Ready</h2> 1. Launch Adobe XD.<br /> 2. Open Plugins menu. Select Discover Plugins. Search 'World Ready'<br /> 3. To install the plugin, simply click on Install button The setup is complete. Now let's check our file for localization readiness. <h2 style='marginLeft: -10px'> Check if localized strings fit elements in all our languages</h2> When we're creating designs, we usually size the elements to fit the language that we're working in. However, we often don't pay attension to other languages that this file will be localized into. Let's use World Ready to very quickly check our file for localized strings that don't fit inside the elements that we've designed.<br /> 1. With the design open in Adobe XD, select the artboard that you want to test. Note: Select a single artboard on your file.<br /> 2. From the Plugins menu, choose World Ready.<br /> 3. In the World Ready dialog, choose a translation service. Note: The default translation service(translated by Microsoft) is available out-of-the-box with this plugin. To use the other services, enter a valid license key for that service. To get a license key, just click the (?) to the right of the API Key box. The licence key will be stored at WIN: 'C:\\Users\\<user>\\AppData\\Local\\Packages\\Adobe.CC.XD_adky2gkssdxte\\LocalState\\plugin_settings\\com.g11n.worldready' MAC: '\\Users\\<user>\\Library\\Application Support\\Adobe\\Adobe XD CC\\plugin_settings\\com.g11n.worldready' on your system.<br /> 4.Choose Highlight.<br /> 5. Then pick one or more of the languages that you want to test your artboard against. Note: World Ready currently supports the listed set of languages.<br /> 6. Click Highlight.<br /> 7. Wait for a bit. If the translated text for any one or more of the languages extends beyond the text elements in your artboard, you'll see red bounding boxes around those elements. Also, World Ready puts the text for the longest translated strings in the background.<br /> 8. You can now either resize the elements or change the text.<br /> 9. If required, run the test again.<br /> 10. If you have more text-based artboards, run the test on those too. Your file is now World Ready. <h2 style='marginLeft: -10px'>Preview localized artboards</h2> Create Preview artboards in other languages and compare them to the ones that you've written.<br /> 1. With the design open in Adobe XD, select the artboard that you want to preview in another language. Note: Select a single artboard on your file.<br /> 2. From the Plugins menu, choose World Ready.<br /> 3. In the World Ready dialog, choose a translation service. Note: The default translation service(translated by Microsoft) is available out-of-the-box with this plugin. To use the other services, enter a valid license key for that service. To get a license key, just click the (?) to the right of the API Key box. The licence key will be stored at WIN: 'C:/Users/<user>/AppData/Local/Packages/Adobe.CC.XD_adky2gkssdxte/LocalState/plugin_settings/com.g11n.worldready' MAC: '/Users/<user>/Library/Application Support/Adobe/Adobe XD CC/plugin_settings/com.g11n.worldready' on your system.<br /> 4. Choose Translate.<br /> 5. Then pick languages that you want to Preview and compare these artboards against Note: World Ready currently supports the listed set of languages.<br /> 6. Click Translate.<br /> 7. Wait for a bit. Duplicate artboards are placed inside the frame. Also, the text in that artboard is translated into the language you selected. You can now compare the these artboards.<br /> Clear World Ready elements from your file After you've done using World Ready to check or preview your Artboards, make sure that you clear the World Ready elements off your file. <br /> 1. From the Plugins menu, choose World Ready.<br /> 2. Choose Undo Translation. All World Ready elements are now removed from your file. <h2 style='marginLeft: -10px'> Credits </h2> Akulaa Agarwal Ankit Kapoor Achintya Dixit Rajat Budhiraja Chhaya Nathani Note: Adobe is using translations from machine translation providers, who are directly liable for the translations, not Adobe. The translation APIs do not handle special characters. User’s license key persists on their client machine in user folder.",
  "About_MENU": "About",
  "HELP_MENU": "Help",
  "LAUNCH_MENU": "Launch Plugin",
  "SUPPORT": "Support",
  "CONTACT_US": "Contact Us"
}