{
    "DEFAULT_TRANSLATOR": "Traducteur par défaut",
    "GOOGLE_TRANSLATE": "Google Traduction",
    "MICROSOFT_TRANSLATE": "Microsoft Traduction",
    "HIGHLIGHT_MODE": "Mettre en évidence la traduction la plus longue",
    "TRANSLATE_MODE": "Prévisualiser le plan de travail traduit",
    "REMOVE_MODE": "Effacer les traductions",
    "TRANSLATE_WITH_LABEL": "Traduire avec",
    "ADOBE_TRANSLATION_LIMIT": "Limité à 10 000 mots par mois. Traduit par ",
    "API_KEY_LABEL": "Clé de l’API",
    "LANGUAGES_LABEL": "Langues",
    "SOURCE_LANGUAGE_LABEL": "(Sélectionner la langue source)",
    "GERMAN_LABEL": "Allemand",
    "FRENCH_LABEL": "Français",
    "JAPANESE_LABEL": "Japonais",
    "SPANISH_LABEL": "Espagnol",
    "ITALIAN_LABEL": "Italien",
    "CHINESE_SIMPLIFIED_LABEL": "Chinois simplifié",
    "KOREAN_LABEL": "Coréen",
    "RUSSIAN_LABEL": "Russe",
    "TURKISH_LABEL": "Turc",
    "UKRAINIAN_LABEL": "Ukrainien",
    "FINNISH_LABEL": "Finnois",
    "BRAZILIAN_PORTUGUESE_LABEL": "Portugais (Brésil)",
    "DUTCH_LABEL": "Néerlandais",
    "SWEDISH_LABEL": "Suédois",
    "ENGLISH_LABEL": "Anglais",
    "OK_BUTTON": "OK",
    "MODE_LABEL": "Mode",
    "HIGHLIGHT_LABEL": "Aperçu",
    "TRANSLATE_LABEL": "Traduire",
    "HIGHLIGHT_DETAIL": "Met en évidence les zones de texte qui devraient être plus grandes pour la localisation. Affiche la traduction la plus longue par chaîne.",
    "TRANSLATE_DETAIL": "Traduit tout le texte dans les langues sélectionnées. Les plans de travail sont dupliqués par langue.",
    "CANCEL_BUTTON": "Annuler",
    "UNDO_TRANSLATIONS": "Annuler les traductions",
    "SOURCE_ARTBOARD_ERROR": "Sélectionnez un plan de travail source pour exécuter les actions World Ready.",
    "ERROR_LABEL": "Error",
    "SELECTION_MESSAGE": "Commencer avec une sélection",
    "ARTBOARD_SELECTOPN_MESSAGE": "Sélectionnez un plan de travail pour utiliser World Ready.",
    "WORLDREADY_LABEL": "World Ready",
    "ANALYTICS_HEADER": "Analyses",
    "ACCEPT_BUTTON": "Accepter",
    "GENERIC_ERROR": "Erreur générique : vérifiez le réseau ou réessayez plus tard.",
    "TIMEOUT_ERROR": "La demande a expiré. Veuillez réessayer ultérieurement.",
    "PLUGIN_TIMEOUT": "Le module World Ready a expiré. Veuillez réessayer ultérieurement.",
    "WARNING_LABEL": "Avertissement",
    "UNTRANSLATED_STRINGS_WARNING": "Certaines chaînes peuvent rester non traduites en raison d’une erreur de service.",
    "SUCCESS_LABEL": "Opération réussie",
    "WORLD_READY_SUCCESS_MESSAGE": "Bon travail ! Votre conception est prête pour le monde. \nRien à mettre en évidence pour les langues sélectionnées.",
    "NO_REPEAT_GRID_SUPPORT_WARNING": "L’aperçu ne prend pas en charge les fonctions Grille de répétition et Instance de symbole.",
    "SOURCE_LANG_LABEL": "Langue source ",
    "ANALYTICS_MESSAGE": "Ce module collecte les données d’utilisation et les soumet aux serveurs Adobe sécurisés via des requêtes HTTPS afin d’améliorer votre expérience d’utilisation du module.\n\nPour suivre les analyses, ce module doit stocker le texte (les chaînes) que vous envoyez pour traduction à nos serveurs sécurisés.\n\nLe texte (les chaînes) stocké ne sera ni distribué ni utilisé à d’autres fins, à l’exception des tendances d’utilisation et des analyses permettant d’améliorer l’expérience utilisateur.\n\nEn cliquant sur Accepter, vous acceptez toutes les conditions ci-dessus et vous pouvez continuer à utiliser le module. Pour désactiver la collecte de données d’utilisation, vous pouvez supprimer ce module à tout moment en procédant comme suit :\nAccédez au menu Plug-ins. Sélectionnez Gérer les plug-ins.\nRecherchez World Ready et cliquez sur Désinstaller dans ses paramètres.\n\n",
    "SUMMARY": "Localisez vos designs",
    "DESCRIPTION": "Le module World Ready peut être utilisé pour 1. Vérifier la disposition de vos plans de travail pour la préparation à la localisation et 2. Générer des plans de travail localisés. Après avoir lancé le module dans le menu Plug-ins dans XD, choisissez un service de traduction, choisissez le mode « Aperçu » ou « Traduire », puis sélectionnez les langues à tester.\n\n - Mode Aperçu : affiche les cadres de sélection rouges autour de tous les éléments de texte pour lesquels au moins une langue ne convient pas au plan de travail sélectionné. Les éléments affichent également la chaîne traduite la plus longue.\n\n - Mode Traduire : crée des plans de travail avec du texte traduit qui vous permet de comparer les plans d’une langue à l’autre.\n\n Pour plus d’informations, consultez le fichier Lisez-moi inclus dans le module.",
    "KEYWORDS": [
        "traduire",
        "traduction",
        "localiser",
        "localisation",
        "multilingue",
        "globalisation",
        "mise en page",
        "productivité",
        "collaboration"
      ],
    "ABOUT_SUMMARY": "<h1 style='marginLeft: -10px'>Le module World Ready pour Adobe XD</h1> Lors de la conception de vos fichiers, n’oubliez pas qu’ils seront ensuite localisés dans plusieurs langues. Utilisez le module World Ready pour vous assurer que le texte de vos plans de travail correspond bien aux éléments des langues dans lesquelles vous envisagez de localiser votre fichier. Ou utilisez World Ready pour comparer rapidement les éléments de la langue d’origine une fois traduits dans une autre langue. <h2 style='marginLeft: -10px'>Installez World Ready</h2><br /> 1. Démarrez Adobe XD.<br /> 2. Ouvrez le menu Plug-ins. Sélectionnez Découvrir des plug-ins. Recherchez « World Ready ».<br /> 3. Pour installer le module, cliquez simplement sur le bouton Installer. La configuration est terminée. Vérifions maintenant que notre fichier est prêt pour la localisation. <h2 style='marginLeft: -10px'> Vérifiez si les chaînes localisées correspondent aux éléments dans toutes nos langues.</h2> Lorsque nous créons des designs, nous dimensionnons généralement les éléments pour qu’ils correspondent à la langue dans laquelle nous travaillons. Cependant, nous ne faisons souvent pas attention aux autres langues dans lesquelles ce fichier sera localisé. Utilisons World Ready pour vérifier très rapidement dans notre fichier les chaînes localisées qui ne rentrent pas dans les éléments que nous avons conçus.<br /> 1. Lorsque la conception est ouverte dans Adobe XD, sélectionnez le plan de travail que vous souhaitez tester. Remarque : sélectionnez un plan de travail unique de votre fichier.<br /> 2. Dans le menu Plug-ins, choisissez World Ready.<br /> 3. Dans la boîte de dialogue World Ready, choisissez un service de traduction. Remarque : le service de traduction par défaut (traduit par Microsoft) est disponible directement avec ce module. Pour utiliser un autre service, entrez une clé de licence valide pour ce service. Pour obtenir une clé de licence, cliquez simplement sur le bouton (?) sur la droite du champ Clé d’API. La clé de licence sera stockée dans le répertoire WIN : C:\\Users\\<utilisateur>\\AppData\\Local\\Packages\\Adobe.CC.XD_adky2gkssdxte\\LocalState\\plugin_settings\\com.g11n.worldready ou MAC : \\Users\\<utilisateur>\\Library\\Application Support\\Adobe\\Adobe XD CC\\plugin_settings\\com.g11n.worldready sur votre système.<br /> 4. Choisissez Aperçu.<br /> 5. Choisissez ensuite une ou plusieurs des langues avec lesquelles vous souhaitez tester votre plan de travail. Remarque : World Ready prend actuellement en charge l’ensemble des langues répertoriées.<br /> 6. Cliquez sur Aperçu.<br /> 7. Patientez un instant. Si le texte traduit pour une ou plusieurs langues s’étend au-delà des éléments de texte de votre plan de travail, vous verrez des cadres de sélection rouges autour de ces éléments. En outre, World Ready place le texte des chaînes traduites les plus longues en arrière-plan.<br /> 8. Vous pouvez maintenant redimensionner les éléments ou changer le texte.<br /> 9. Si nécessaire, relancez le test.<br /> 10. Si vous avez plus de plans de travail textuels, testez-les également. Votre fichier est maintenant World Ready. <h2 style='marginLeft: -10px'>Prévisualisation de plans de travail localisés</h2> Créez des aperçus de plans de travail dans d’autres langues et comparez-les à ceux que vous avez rédigés.<br /> 1. Avec la conception ouverte dans Adobe XD, sélectionnez le plan de travail que vous souhaitez prévisualiser dans une autre langue. Remarque : sélectionnez un plan de travail unique de votre fichier.<br /> 2. Dans le menu Plug-ins, choisissez World Ready.<br /> 3. Dans la boîte de dialogue World Ready, choisissez un service de traduction. Remarque : le service de traduction par défaut (traduit par Microsoft) est disponible directement avec ce module. Pour utiliser un autre service, entrez une clé de licence valide pour ce service. Pour obtenir une clé de licence, cliquez simplement sur le bouton (?) sur la droite du champ Clé d’API. La clé de licence sera stockée dans le répertoire WIN : C:/Users/<utilisateur>/AppData/Local/Packages/Adobe.CC.XD_adky2gkssdxte/LocalState/plugin_settings/com.g11n.worldready ou MAC : /Users/<utilisateur>/Library/Application Support/Adobe/Adobe XD CC/plugin_settings/com.g11n.worldready sur votre système.<br /> 4. Choisissez Traduire.<br /> 5. Choisissez ensuite les langues que vous souhaitez prévisualiser et comparez ces plans de travail. Remarque : World Ready prend actuellement en charge l’ensemble des langues répertoriées.<br /> 6. Cliquez sur Traduire.<br /> 7. Patientez un instant. Des plans de travail en double sont placés à l’intérieur du cadre. En outre, le texte de ce plan de travail est traduit dans la langue sélectionnée. Vous pouvez maintenant comparer ces plans de travail.<br /> Suppression des éléments World Ready de votre fichier Après avoir utilisé World Ready pour vérifier ou prévisualiser vos plans de travail, assurez-vous de supprimer les éléments World Ready de votre fichier.<br /> 1. Dans le menu Plug-ins, choisissez World Ready.<br /> 2. Choisissez Annuler les traductions. Tous les éléments World Ready sont maintenant supprimés de votre fichier. <h2 style='marginLeft: -10px'> Remerciements </h2> Akulaa Agarwal Ankit Kapoor Achintya Dixit Rajat Budhiraja Chhaya Nathani Remarque : Adobe utilise les traductions des fournisseurs de traduction automatique, qui sont directement responsables des traductions, et non Adobe. Les API de traduction ne gèrent pas les caractères spéciaux. La clé de licence de l’utilisateur persiste sur son ordinateur client dans le dossier de l’utilisateur.",
    "About_MENU": "À propos",
    "HELP_MENU": "Aide",
    "LAUNCH_MENU": "Démarrer le module",
    "SUPPORT": "Assistance technique",
    "CONTACT_US": "Nous contacter"
}
