{
    "DEFAULT_TRANSLATOR": "기본 번역기",
    "GOOGLE_TRANSLATE": "Google 번역",
    "MICROSOFT_TRANSLATE": "Microsoft 번역",
    "HIGHLIGHT_MODE": "가장 긴 번역 강조 표시",
    "TRANSLATE_MODE": "번역된 아트보드 미리보기",
    "REMOVE_MODE": "번역 지우기",
    "TRANSLATE_WITH_LABEL": "번역 도구",
    "ADOBE_TRANSLATION_LIMIT": "월간 10,000단어로 제한됩니다. 번역자: ",
    "API_KEY_LABEL": "API 키",
    "LANGUAGES_LABEL": "언어",
    "SOURCE_LANGUAGE_LABEL": "(소스 언어 선택)",
    "GERMAN_LABEL": "독일어",
    "FRENCH_LABEL": "프랑스어",
    "JAPANESE_LABEL": "일본어",
    "SPANISH_LABEL": "스페인어",
    "ITALIAN_LABEL": "이탈리아어",
    "CHINESE_SIMPLIFIED_LABEL": "중국어 간체",
    "KOREAN_LABEL": "한국어",
    "RUSSIAN_LABEL": "러시아어",
    "TURKISH_LABEL": "터키어",
    "UKRAINIAN_LABEL": "우크라이나어",
    "FINNISH_LABEL": "핀란드어",
    "BRAZILIAN_PORTUGUESE_LABEL": "브라질 포르투갈어",
    "DUTCH_LABEL": "네덜란드어",
    "SWEDISH_LABEL": "스웨덴어",
    "ENGLISH_LABEL": "영어",
    "OK_BUTTON": "확인",
    "MODE_LABEL": "모드",
    "HIGHLIGHT_LABEL": "하이라이트",
    "TRANSLATE_LABEL": "번역",
    "HIGHLIGHT_DETAIL": "현지화를 위해 크기를 더 키워야 하는 텍스트 상자를 강조 표시합니다. 문자열당 가장 긴 번역을 표시합니다.",
    "TRANSLATE_DETAIL": "모든 텍스트를 선택한 언어로 번역합니다. 아트보드는 언어별로 복제됩니다.",
    "CANCEL_BUTTON": "취소",
    "UNDO_TRANSLATIONS": "번역 실행 취소",
    "SOURCE_ARTBOARD_ERROR": "World Ready 작업을 실행하려면 소스 아트보드를 선택하십시오.",
    "ERROR_LABEL": "오류",
    "SELECTION_MESSAGE": "선택 항목을 사용하여 시작",
    "ARTBOARD_SELECTOPN_MESSAGE": "World Ready를 사용하려면 아트보드를 선택하십시오.",
    "WORLDREADY_LABEL": "World Ready",
    "ANALYTICS_HEADER": "Analytics",
    "ACCEPT_BUTTON": "동의",
    "GENERIC_ERROR": "일반 오류: 네트워크를 확인하거나 나중에 다시 시도하십시오.",
    "TIMEOUT_ERROR": "요청 시간이 초과되었습니다. 나중에 다시 시도하십시오.",
    "PLUGIN_TIMEOUT": "World Ready 플러그인 시간이 초과되었습니다. 나중에 다시 시도하십시오.",
    "WARNING_LABEL": "경고",
    "UNTRANSLATED_STRINGS_WARNING": "일부 문자열은 서비스 오류로 인해 번역되지 않은 상태로 남아 있을 수 있습니다.",
    "SUCCESS_LABEL": "성공",
    "WORLD_READY_SUCCESS_MESSAGE": "수고하셨습니다! 귀하의 디자인은 World Ready입니다. \n선택한 언어에 대해 강조 표시할 항목이 없습니다.",
    "NO_REPEAT_GRID_SUPPORT_WARNING": "반복 그리드 및 심볼 인스턴스에 대해서는 미리보기가 지원되지 않습니다.",
    "SOURCE_LANG_LABEL": "소스 언어 ",
    "ANALYTICS_MESSAGE": "이 플러그인은 플러그인 사용 시 사용자 경험을 개선하기 위해 사용 데이터를 수집하고 이를 보안 목적으로 HTTPS 요청을 통해 Adobe 서버로 제출합니다.\n\n분석 내용을 추적하기 위해 이 플러그인은 사용자가 번역을 위해 당사의 보안 서버로 전송하는 텍스트(문자열)를 보관해야 할 필요가 있습니다.\n\n보관된 텍스트(문자열)는 사용자 경험을 개선하기 위한 사용 동향 및 분석을 제외하고 어떠한 다른 목적으로도 배포되거나 사용되지 않습니다.\n\n[동의]를 클릭하면 위에 기재된 모든 내용에 동의하는 것으로 간주되며 이후 플러그인을 사용할 수 있습니다. 사용 데이터 수집을 거부하려면 다음 단계에 따라 언제든지 이 플러그인을 삭제할 수 있습니다.\n플러그인 메뉴로 이동합니다. 플러그인 관리를 선택합니다.\nWorld Ready를 찾아 해당 설정에서 [제거]를 클릭합니다.\n\n",
    "SUMMARY": "디자인 현지화",
    "DESCRIPTION": "World Ready 플러그인을 사용하여 다음과 같은 작업을 수행할 수 있습니다. 1. 현지화 준비를 위해 아트보드의 레이아웃을 확인합니다. 2. 현지화된 아트보드를 생성합니다. XD의 플러그인 메뉴에서 플러그인을 실행한 후 번역 서비스를 선택하고 “하이라이트” 또는 “번역” 모드를 선택한 다음 테스트할 언어를 선택합니다.\n\n  - 하이라이트 모드: 최소 하나 이상의 언어가 선택한 아트보드에서 맞지 않는 모든 텍스트 요소 주변을 빨간색 테두리 상자로 표시합니다. 요소는 또한 가장 긴 번역 문자열도 표시합니다.\n\n  - 번역 모드: 언어별로 아트보드를 비교할 수 있도록 번역된 텍스트가 포함된 아트보드를 생성합니다.\n\n  보다 자세한 내용은 플러그인에 포함된 읽어보기 파일을 참조하십시오.",
    "KEYWORDS": [
        "번역",
        "번역",
        "현지화",
        "현지화",
        "다국어",
        "글로벌화",
        "레이아웃",
        "생산성",
        "공동 작업"
      ],
    "ABOUT_SUMMARY": "<h1 style='marginLeft: -10px'>Adobe XD용 World Ready 플러그인</h1> 파일을 디자인할 때 이들 파일이 나중에 여러 언어로 현지화될 것임을 염두에 두십시오. World Ready 플러그인을 사용하여 아트보드의 텍스트가 파일을 현지화할 언어의 요소에 맞는지 확인하십시오. 또는 World Ready를 사용하여 원어가 다른 언어로 번역되면 해당 요소가 어떻게 보이는지 빠르게 비교할 수 있습니다. <h2 style='marginLeft: -10px'>World Ready 설치</h2><br /> 1. Adobe XD를 실행합니다.<br /> 2. 플러그인 메뉴를 엽니다. 플러그인 탐색을 선택합니다. “World Ready”를 검색합니다.<br /> 3. 플러그인을 설치하려면 설치 버튼을 클릭합니다. 이제 설정이 완료되었습니다. 이제 현지화 준비에 대한 파일을 확인해 볼 차례입니다. <h2 style='marginLeft: -10px'> 현지화된 문자열이 모든 사용 언어의 요소에 맞는지 확인</h2> 디자인을 제작할 때 일반적으로 요소의 크기를 조정하여 작업 중인 언어에 맞춥니다. 하지만 우리는 종종 이 파일이 현지화될 다른 언어에 대해서는 주의를 기울이지 않습니다. World Ready를 사용하면 파일에서 현지화된 문자열이 디자인한 요소와 맞는지 여부를 빠르게 확인할 수 있습니다.<br /> 1. Adobe XD에서 디자인을 열고 테스트할 아트보드를 선택합니다. 참고: 파일에서 하나의 아트보드만 선택하십시오.<br /> 2. 플러그인 메뉴에서 World Ready를 선택합니다.<br /> 3. World Ready 대화 상자에서 번역 서비스를 선택합니다. 참고: 기본 번역 서비스(Microsoft 번역)는 이 플러그인에서 바로 사용할 수 있습니다. 다른 서비스를 이용하려면 해당 서비스에 대해 유효한 라이선스 키를 입력하십시오. 라이선스 키를 받으려면 API 키 상자의 오른쪽에 있는 (?)를 클릭합니다. 내 컴퓨터에서의 라이선스 키 저장 위치: WIN: 'C:\\Users\\<사용자>\\AppData\\Local\\Packages\\Adobe.CC.XD_adky2gkssdxte\\LocalState\\plugin_settings\\com.g11n.worldready' MAC: '\\Users\\<사용자>\\Library\\Application Support\\Adobe\\Adobe XD CC\\plugin_settings\\com.g11n.worldready'<br /> 4. 하이라이트를 선택합니다.<br /> 5. 그런 다음 아트보드에 대해 테스트할 언어를 하나 이상 선택합니다. 참고: 현재 World Ready는 나열된 언어 세트를 지원합니다.<br /> 6. 하이라이트를 클릭합니다.<br /> 7. 잠시 기다립니다. 하나 이상의 언어에 대해 번역된 텍스트가 아트보드의 텍스트 요소를 넘어 서면 해당 요소 주변에 빨간색 테두리 상자가 표시됩니다. 또한 World Ready는 가장 긴 번역 문자열에 대한 텍스트를 배경에 넣습니다.<br /> 8. 이제 요소의 크기를 조정하거나 텍스트를 변경할 수 있습니다.<br /> 9. 필요한 경우 테스트를 다시 실행하십시오.<br /> 10. 텍스트 기반의 아트보드가 더 있는 경우 이들에 대한 테스트도 실행합니다. 이제 파일은 World Ready입니다. <h2 style='marginLeft: -10px'>현지화된 아트보드 미리보기</h2> 다른 언어로 아트보드 미리보기를 생성하고 이를 이전에 작성한 아트보드와 비교합니다.<br /> 1. Adobe XD에서 디자인을 열고 다른 언어로 미리보기할 아트보드를 선택합니다. 참고: 파일에서 하나의 아트보드만 선택하십시오.<br /> 2. 플러그인 메뉴에서 World Ready를 선택합니다.<br /> 3. World Ready 대화 상자에서 번역 서비스를 선택합니다. 참고: 기본 번역 서비스(Microsoft 번역)는 이 플러그인에서 바로 사용할 수 있습니다. 다른 서비스를 이용하려면 해당 서비스에 대해 유효한 라이선스 키를 입력하십시오. 라이선스 키를 받으려면 API 키 상자의 오른쪽에 있는 (?)를 클릭합니다. 내 컴퓨터에서의 라이선스 키 저장 위치: WIN: 'C:/Users/<사용자>/AppData/Local/Packages/Adobe.CC.XD_adky2gkssdxte/LocalState/plugin_settings/com.g11n.worldready' MAC: '/Users/<사용자>/Library/Application Support/Adobe/Adobe XD CC/plugin_settings/com.g11n.worldready'<br /> 4. 번역을 선택합니다.<br /> 5. 그런 다음 미리보기할 언어를 선택하고 이들 아트보드와 비교합니다. 참고: 현재 World Ready는 나열된 언어 세트를 지원합니다.<br /> 6. 번역을 클릭합니다.<br /> 7. 잠시 기다립니다. 복제된 아트보드가 프레임 안에 배치됩니다. 또한 해당 아트보드의 텍스트가 선택한 언어로 번역됩니다. 이제 이들 아트보드를 비교할 수 있습니다.<br /> 아트보드를 확인하거나 미리 보기 위해 World Ready를 사용한 후에는 파일에서 World Ready 요소를 지워야 합니다.<br /> 1. 플러그인 메뉴에서 World Ready를 선택합니다.<br /> 2. 번역 실행 취소를 선택합니다. 이제 모든 World Ready 요소가 파일에서 제거됩니다. <h2 style='marginLeft: -10px'> 크레딧 </h2> Akulaa Agarwal Ankit Kapoor Achintya Dixit Rajat Budhiraja Chhaya Nathani 참고: Adobe는 Adobe가 아닌 해당 번역에 대해 직접적인 책임이 있는 기계 번역 제공업체의 번역을 사용하고 있습니다. 번역 API는 특수 문자를 처리하지 않습니다. 사용자의 라이선스 키는 클라이언트 컴퓨터의 사용자 폴더에 유지됩니다.",
    "About_MENU": "정보",
    "HELP_MENU": "도움말",
    "LAUNCH_MENU": "플러그인 실행",
    "SUPPORT": "지원",
    "CONTACT_US": "문의"
}
