{
    "DEFAULT_TRANSLATOR": "Tradutor padrão",
    "GOOGLE_TRANSLATE": "Google Tradutor",
    "MICROSOFT_TRANSLATE": "Microsoft Translator",
    "HIGHLIGHT_MODE": "Realçar tradução mais longa",
    "TRANSLATE_MODE": "Visualizar prancheta traduzida",
    "REMOVE_MODE": "Limpar traduções",
    "TRANSLATE_WITH_LABEL": "Traduzir com",
    "ADOBE_TRANSLATION_LIMIT": "Limitado a 10.000 palavras por mês. Traduzido por ",
    "API_KEY_LABEL": "Chave de API",
    "LANGUAGES_LABEL": "Idiomas",
    "SOURCE_LANGUAGE_LABEL": "(Selecionar idioma de origem)",
    "GERMAN_LABEL": "Alemão",
    "FRENCH_LABEL": "Francês",
    "JAPANESE_LABEL": "Japonês",
    "SPANISH_LABEL": "Espanhol",
    "ITALIAN_LABEL": "Italiano",
    "CHINESE_SIMPLIFIED_LABEL": "Chinês simplificado",
    "KOREAN_LABEL": "Coreano",
    "RUSSIAN_LABEL": "Russo",
    "TURKISH_LABEL": "Turco",
    "UKRAINIAN_LABEL": "Ucraniano",
    "FINNISH_LABEL": "Finlandês ",
    "BRAZILIAN_PORTUGUESE_LABEL": "Português do Brasil",
    "DUTCH_LABEL": "Nederlands",
    "SWEDISH_LABEL": "Sueco",
    "ENGLISH_LABEL": "inglês",
    "OK_BUTTON": "OK",
    "MODE_LABEL": "Modo",
    "HIGHLIGHT_LABEL": "Realçar",
    "TRANSLATE_LABEL": "Traduzir",
    "HIGHLIGHT_DETAIL": "Realça as caixas de texto que deveriam ser maiores para acomodar a tradução. Mostra a tradução mais longa por string.",
    "TRANSLATE_DETAIL": "Traduz todo o texto para os idiomas selecionados. As pranchetas são duplicadas por idioma.",
    "CANCEL_BUTTON": "Cancelar",
    "UNDO_TRANSLATIONS": "Desfazer traduções",
    "SOURCE_ARTBOARD_ERROR": "Selecione a prancheta de origem para executar ações do World Ready.",
    "ERROR_LABEL": "Erro",
    "SELECTION_MESSAGE": "Começar com uma seleção",
    "ARTBOARD_SELECTOPN_MESSAGE": "Selecione uma prancheta para usar o World Ready.",
    "WORLDREADY_LABEL": "World Ready",
    "ANALYTICS_HEADER": "Analytics",
    "ACCEPT_BUTTON": "Aceitar",
    "GENERIC_ERROR": "Erro genérico: verifique a conexão de rede ou tente novamente mais tarde.",
    "TIMEOUT_ERROR": "O tempo da solicitação expirou. Tente novamente mais tarde.",
    "PLUGIN_TIMEOUT": "O tempo do plug-in World Ready expirou. Tente novamente mais tarde.",
    "WARNING_LABEL": "Aviso ",
    "UNTRANSLATED_STRINGS_WARNING": "Algumas strings podem permanecer sem tradução devido a um erro de serviço.",
    "SUCCESS_LABEL": "Êxito",
    "WORLD_READY_SUCCESS_MESSAGE": "Bom trabalho! Seu design está pronto com o World Ready. \nNada para ser realçado nos idiomas selecionados.",
    "NO_REPEAT_GRID_SUPPORT_WARNING": "A visualização não é compatível com repetição de grade e instâncias de símbolos.",
    "SOURCE_LANG_LABEL": "Idioma de origem ",
    "ANALYTICS_MESSAGE": "Este plug-in coleta dados de uso e os envia com segurança para os servidores da Adobe por meio de solicitações HTTPS para aprimorar sua experiência de uso do plug-in.\n\nPor motivos de análises de dados, o texto (strings) traduzido é armazenado em nossos servidores protegidos.\n\nO texto (strings) armazenado não será distribuído ou usado para nenhum outro objetivo, exceto para gerar análises e tendências de uso para aprimorar a experiência.\n\nAo clicar em aceitar, você concorda com as informações citadas acima e pode prosseguir com a utilização do plug-in. Para desativar a coleta dos dados de uso, exclua este plug-in a qualquer momento seguindo as etapas abaixo:\nVá para o menu Plug-ins. Selecione Gerenciar plug-ins.\nEscolha World Ready, acesse as configurações e clique em Desinstalar.\n\n",
    "SUMMARY": "Localize seus designs.",
    "DESCRIPTION": "O plug-in World Ready pode ser usado para: 1. Verificar o layout de suas pranchetas para prepará-las para tradução e 2. Gerar pranchetas traduzidas. Depois de iniciar o plug-in no menu Plug-ins no XD, escolha um serviço de tradução, selecione o modo “Realçar” ou “Traduzir” e selecione os idiomas que deseja testar.\n\n  - Modo Realçar: exibe caixas delimitadoras vermelhas ao redor dos elementos de texto para os quais a tradução de pelo menos um idioma não se ajusta à prancheta selecionada. Os elementos também exibem a maior string traduzida.\n\n  - Modo Traduzir: cria pranchetas com texto traduzido que permite comparar as pranchetas entre todos os idiomas.\n\n  Para saber mais, leia o arquivo Leiame que acompanha o plug-in.",
    "KEYWORDS": [
        "traduzir",
        "tradução",
        "localizar",
        "localização",
        "multilíngue",
        "globalização",
        "layout",
        "produtividade",
        "colaboração"
      ],
    "ABOUT_SUMMARY": "<h1 style='marginLeft: -10px'>Plug-in World Ready para o Adobe XD</h1> Durante a criação de seus arquivos, lembre-se de que eles serão traduzidos para vários idiomas. Use o plug-in World Ready para garantir que o texto nas pranchetas se ajuste aos elementos em todos os idiomas para os quais você deseja traduzir o seu arquivo. Ou use o World Ready para comparar rapidamente quais elementos no idioma original serão exibidos depois que forem traduzidos para outro idioma. <h2 style='marginLeft: -10px'>Instalar o World Ready</h2><br /> 1. Abra o Adobe XD.<br /> 2. Abra o menu Plug-ins. Selecione Descobrir plug-ins. Procure “World Ready”<br /> 3. Para instalar o plug-in, clique no botão Instalar. A configuração está concluída. Agora vamos verificar nosso arquivo para preparação para tradução. <h2 style='marginLeft: -10px'> Verificar se as strings traduzidas encaixam-se nos elementos de todos os idiomas</h2> Quando criamos designs, geralmente dimensionamos os elementos para o idioma no qual estamos trabalhando. No entanto, não prestamos atenção aos outros idiomas para os quais o arquivo será traduzido. Vamos usar o World Ready para verificar rapidamente as strings traduzidas que não se ajustam aos elementos criados.<br /> 1. Com o design aberto no Adobe XD, selecione a prancheta que deseja testar. Observação: selecione uma única prancheta no arquivo.<br /> 2. No menu Plug-ins, selecione World Ready.<br /> 3. Na caixa de diálogo World Ready, selecione um serviço de tradução. Observação: o serviço de tradução padrão (traduzido pela Microsoft) está disponível com este plug-in. Para usar outros serviços, insira uma chave de licença válida para eles. Para obter uma chave de licença, clique em (?) à direita da caixa Chave de API. No Windows, a chave de licença será armazenada em: C:\\Users\\<usuário>\\AppData\\Local\\Packages\\Adobe.CC.XD_adky2gkssdxte\\LocalState\\plugin_settings\\com.g11n.worldready. No Mac, será armazenada em: \\Users\\<usuário>\\Library\\Application Support\\Adobe\\Adobe XD CC\\plugin_settings\\com.g11n.worldready.<br /> 4. Selecione Realçar.<br /> 5. Em seguida, escolha um ou mais idiomas para os quais você deseja testar sua prancheta. Observação: o World Ready é compatível com os idiomas listados.<br /> 6. Clique em Realçar.<br /> 7. Aguarde alguns minutos. Se o texto traduzido para um ou mais idiomas ultrapassar o limite dos elementos de texto na prancheta, você verá caixas delimitadoras vermelhas ao redor desses elementos. Além disso, o World Ready posiciona o texto das strings traduzidas mais longas no fundo.<br /> 8. Agora, você pode redimensionar os elementos ou alterar o texto.<br /> 9. Se necessário, execute o teste novamente.<br /> 10. Se você tiver mais pranchetas de texto, execute o teste nelas também. Seu arquivo agora está pronto com o World Ready. <h2 style='marginLeft: -10px'>Visualizar pranchetas traduzidas</h2> Crie Pranchetas de visualização em outros idiomas e compare-as com as que você escreveu.<br /> 1. Com o design aberto no Adobe XD, selecione a prancheta que deseja visualizar em outro idioma. Observação: selecione uma única prancheta no arquivo.<br /> 2. No menu Plug-ins, selecione World Ready.<br /> 3. Na caixa de diálogo World Ready, selecione um serviço de tradução. Observação: o serviço de tradução padrão (traduzido pela Microsoft) está disponível com este plug-in. Para usar outros serviços, insira uma chave de licença válida para eles. Para obter uma chave de licença, clique em (?) à direita da caixa Chave de API. No Windows, a chave de licença será armazenada em: C:\\Users\\<usuário>\\AppData\\Local\\Packages\\Adobe.CC.XD_adky2gkssdxte\\LocalState\\plugin_settings\\com.g11n.worldready. No Mac, será armazenada em: C:\\Users\\<usuário>\\Library\\Application Support\\Adobe\\Adobe XD CC\\plugin_settings\\com.g11n.worldready.<br /> 4. Selecione Traduzir.<br /> 5. Em seguida, selecione os idiomas que deseja Visualizar e compare as pranchetas. Observação: o World Ready é compatível com os idiomas listados.<br /> 6. Clique em Traduzir.<br /> 7. Aguarde alguns minutos. As pranchetas duplicadas são inseridas dentro do quadro. Além disso, o texto na prancheta é traduzido para o idioma selecionado. Agora, você pode comparar as pranchetas.<br /> Após usar o World Ready, é necessário limpar os elementos de seu arquivo para poder verificar ou visualizar suas pranchetas.<br /> 1. No menu Plug-ins, selecione World Ready.<br /> 2. Selecione Desfazer tradução. Agora, todos os elementos do World Ready serão removidos do seu arquivo. <h2 style='marginLeft: -10px'> Créditos </h2> Akulaa Agarwal, Ankit Kapoor, Achintya Dixit, Rajat Budhiraja, Chhaya Nathani. Observação: a Adobe está usando traduções de provedores de tradução automática, que são os responsáveis pela tradução, não a Adobe. As APIs de tradução não são compatíveis com caracteres especiais. A chave de licença do usuário continua armazenada no computador cliente na pasta do usuário.",
    "About_MENU": "Sobre o Adobe MAX",
    "HELP_MENU": "Ajuda",
    "LAUNCH_MENU": "Iniciar plug-in",
    "SUPPORT": "Suporte",
    "CONTACT_US": "Fale conosco"
}
